MadSciencist/Line-Follower---STM32/Inc/main.h
/**
  ******************************************************************************
  * File Name          : main.hpp
  * Description        : This file contains the common defines of the application
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H
  /* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Includes ------------------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private define ------------------------------------------------------------*/

#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define MOT1CURR_Pin GPIO_PIN_0
#define MOT1CURR_GPIO_Port GPIOC
#define MOT2CURR_Pin GPIO_PIN_1
#define MOT2CURR_GPIO_Port GPIOC
#define SEN10_Pin GPIO_PIN_2
#define SEN10_GPIO_Port GPIOC
#define BATT_VOLT_Pin GPIO_PIN_3
#define BATT_VOLT_GPIO_Port GPIOC
#define SEN1_Pin GPIO_PIN_0
#define SEN1_GPIO_Port GPIOA
#define SEN2_Pin GPIO_PIN_1
#define SEN2_GPIO_Port GPIOA
#define SEN3_Pin GPIO_PIN_2
#define SEN3_GPIO_Port GPIOA
#define SEN4_Pin GPIO_PIN_3
#define SEN4_GPIO_Port GPIOA
#define SEN5_Pin GPIO_PIN_4
#define SEN5_GPIO_Port GPIOA
#define SEN6_Pin GPIO_PIN_4
#define SEN6_GPIO_Port GPIOC
#define SEN7_Pin GPIO_PIN_5
#define SEN7_GPIO_Port GPIOC
#define SEN8_Pin GPIO_PIN_0
#define SEN8_GPIO_Port GPIOB
#define SEN9_Pin GPIO_PIN_1
#define SEN9_GPIO_Port GPIOB
#define ENC1A_Pin GPIO_PIN_6
#define ENC1A_GPIO_Port GPIOC
#define ENC1B_Pin GPIO_PIN_7
#define ENC1B_GPIO_Port GPIOC
#define ENC1I_Pin GPIO_PIN_8
#define ENC1I_GPIO_Port GPIOC
#define ENC2I_Pin GPIO_PIN_9
#define ENC2I_GPIO_Port GPIOC
#define ENC2B_Pin GPIO_PIN_8
#define ENC2B_GPIO_Port GPIOA
#define ENC2A_Pin GPIO_PIN_9
#define ENC2A_GPIO_Port GPIOA
#define MOT1PWM_Pin GPIO_PIN_15
#define MOT1PWM_GPIO_Port GPIOA
#define MOT1A_Pin GPIO_PIN_10
#define MOT1A_GPIO_Port GPIOC
#define MOT1B_Pin GPIO_PIN_11
#define MOT1B_GPIO_Port GPIOC
#define MOT2A_Pin GPIO_PIN_12
#define MOT2A_GPIO_Port GPIOC
#define MOT2B_Pin GPIO_PIN_2
#define MOT2B_GPIO_Port GPIOD
#define MOT2PWM_Pin GPIO_PIN_3
#define MOT2PWM_GPIO_Port GPIOB

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
 extern "C" {
#endif
void _Error_Handler(char *, int);

#define Error_Handler() _Error_Handler(__FILE__, __LINE__)
#ifdef __cplusplus
}
#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

#endif /* __MAIN_H */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
